{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"config": {"layers": [{"config": {"dtype": "float32", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 12], "use_bias": true, "units": 35, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "use_bias": true, "units": 10, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "kernel_regularizer": null}, "class_name": "Dense"}], "name": "sequential"}, "class_name": "Sequential"}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense/kernel", "shape": [12, 35], "dtype": "float32"}, {"name": "dense/bias", "shape": [35], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [35, 10], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [10], "dtype": "float32"}]}]}